app/Controllers/MapController.php

    public function getMarkerData()
    {
        $request = \Config\Services::request();
        $sumber_id = $request->getGet('sumber_data_id');
        $koordinat_id = $request->getGet('id_koordinat'); // Tambahkan ini

        $modelKoordinat = new M_koordinat();
        $modelIsiKeterangan = new M_isiKeterangan();
        $modelJudulKeterangan = new M_judulKeterangan();

        // Cek jika filter koordinat_id diterapkan
        if ($koordinat_id) {
            $dataKoordinat = $modelKoordinat->select('koordinat.*, kecamatan.nama_kec, kelurahan.nama_kel, sumber_data.nama_sumber, sumber_data.warna, kota_kab.nama_kotakab')
                ->join('kecamatan', 'kecamatan.id_kec = koordinat.id_kec', 'left')
                ->join('kelurahan', 'kelurahan.id_kel = koordinat.id_kel', 'left')
                ->join('sumber_data', 'sumber_data.id_sumberdata = koordinat.id_sumberdata', 'left')
                ->join('kota_kab', 'kota_kab.id_kotakab = koordinat.id_kotakab', 'left')
                ->where('koordinat.id_koordinat', $koordinat_id) // Filter berdasarkan id_koordinat
                ->findAll();
        } elseif ($sumber_id) {
            $dataKoordinat = $modelKoordinat->select('koordinat.*, kecamatan.nama_kec, kelurahan.nama_kel, sumber_data.nama_sumber, sumber_data.warna, kota_kab.nama_kotakab')
                ->join('kecamatan', 'kecamatan.id_kec = koordinat.id_kec', 'left')
                ->join('kelurahan', 'kelurahan.id_kel = koordinat.id_kel', 'left')
                ->join('sumber_data', 'sumber_data.id_sumberdata = koordinat.id_sumberdata', 'left')
                ->join('kota_kab', 'kota_kab.id_kotakab = koordinat.id_kotakab', 'left')
                ->where('koordinat.id_sumberdata', $sumber_id)
                ->findAll();
---
SELECT `koordinat`.*, `kecamatan`.`nama_kec`, `kelurahan`.`nama_kel`, `sumber_data`.`nama_sumber`, `sumber_data`.`warna`, `kota_kab`.`nama_kotakab`
FROM `koordinat`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kec` = `koordinat`.`id_kec`
LEFT JOIN `kelurahan` ON `kelurahan`.`id_kel` = `koordinat`.`id_kel`
LEFT JOIN `sumber_data` ON `sumber_data`.`id_sumberdata` = `koordinat`.`id_sumberdata`
LEFT JOIN `kota_kab` ON `kota_kab`.`id_kotakab` = `koordinat`.`id_kotakab`
WHERE `koordinat`.`id_koordinat` = '15778'
SELECT `koordinat`.*, `kecamatan`.`nama_kec`, `kelurahan`.`nama_kel`, `sumber_data`.`nama_sumber`, `sumber_data`.`warna`, `kota_kab`.`nama_kotakab`
FROM `koordinat`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kec` = `koordinat`.`id_kec`
LEFT JOIN `kelurahan` ON `kelurahan`.`id_kel` = `koordinat`.`id_kel`
LEFT JOIN `sumber_data` ON `sumber_data`.`id_sumberdata` = `koordinat`.`id_sumberdata`
LEFT JOIN `kota_kab` ON `kota_kab`.`id_kotakab` = `koordinat`.`id_kotakab`
WHERE `koordinat`.`id_sumberdata` = '1'

        }

        foreach ($dataKoordinat as &$koordinat) {
            $koordinat['keterangan'] = $modelIsiKeterangan
                ->select('isi_keterangan.isi_keterangan, judul_keterangan.jdl_keterangan')
                ->join('judul_keterangan', 'judul_keterangan.id_jdlketerangan = isi_keterangan.id_jdlketerangan')
                ->where('isi_keterangan.id_koordinat', $koordinat['id_koordinat'])
                ->findAll();
---
SELECT `isi_keterangan`.`isi_keterangan`, `judul_keterangan`.`jdl_keterangan`
FROM `db_pju`.`isi_keterangan`
JOIN `judul_keterangan` ON `judul_keterangan`.`id_jdlketerangan` = `isi_keterangan`.`id_jdlketerangan`
WHERE `isi_keterangan`.`id_koordinat` = '1'