app/Controllers/MasterDataController.php

    public function index()
    {
        $sumberdataId = $this->request->getVar('sumberdata');

        $koordinatQuery = $this->koordinatModel->select('koordinat.*, kecamatan.nama_kec, kelurahan.nama_kel, sumber_data.nama_sumber, kota_kab.nama_kotakab')
                                             ->join('kecamatan', 'kecamatan.id_kec = koordinat.id_kec', 'left')
                                             ->join('kelurahan', 'kelurahan.id_kel = koordinat.id_kel', 'left')
                                             ->join('sumber_data', 'sumber_data.id_sumberdata = koordinat.id_sumberdata', 'left')
                                             ->join('kota_kab', 'kota_kab.id_kotakab = koordinat.id_kotakab', 'left');

        if ($sumberdataId) {
            $koordinatQuery->where('koordinat.id_sumberdata', $sumberdataId);
        }

        $data = [
            'title'              => 'Data Koordinat',
            'koordinat'          => $koordinatQuery->paginate(10, 'default'),
            'pager'              => $this->koordinatModel->pager,
            'sumberdata'         => $this->sumberDataModel->findAll(),
            'judulKeterangan'    => $this->judulKeteranganModel->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `koordinat`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kec` = `koordinat`.`id_kec`
LEFT JOIN `kelurahan` ON `kelurahan`.`id_kel` = `koordinat`.`id_kel`
LEFT JOIN `sumber_data` ON `sumber_data`.`id_sumberdata` = `koordinat`.`id_sumberdata`
LEFT JOIN `kota_kab` ON `kota_kab`.`id_kotakab` = `koordinat`.`id_kotakab`
WHERE `koordinat`.`id_sumberdata` = '2'
SELECT `koordinat`.*, `kecamatan`.`nama_kec`, `kelurahan`.`nama_kel`, `sumber_data`.`nama_sumber`, `kota_kab`.`nama_kotakab`
FROM `koordinat`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kec` = `koordinat`.`id_kec`
LEFT JOIN `kelurahan` ON `kelurahan`.`id_kel` = `koordinat`.`id_kel`
LEFT JOIN `sumber_data` ON `sumber_data`.`id_sumberdata` = `koordinat`.`id_sumberdata`
LEFT JOIN `kota_kab` ON `kota_kab`.`id_kotakab` = `koordinat`.`id_kotakab`
WHERE `koordinat`.`id_sumberdata` = '2'
 LIMIT 10
SELECT *
FROM `sumber_data`
SELECT *
FROM `judul_keterangan`

    public function form($id = null)
    {
        $data = [
            'title'      => 'Tambah Data Koordinat',
            'koordinat'  => null,
            'kotakab'    => $this->mWilayah->getKotaKab(),
            'kecamatan'  => [],
            'kelurahan'  => [],
            'sumberdata' => $this->sumberDataModel->findAll(),
---
SELECT *
FROM `sumber_data`

            $message = 'Data koordinat dan keterangannya berhasil diperbarui.';
        } else {
            // Create mode
            $this->koordinatModel->insert($dataKoordinat);
---
INSERT INTO `koordinat` (`latitude`, `longitude`, `id_kotakab`, `id_kec`, `id_kel`, `id_sumberdata`, `created_at`, `updated_at`) VALUES ('25.197126594948827', '55.27432275138096', '3201', '320106', '3201170006', '3', '2025-09-03 08:39:09', '2025-09-03 08:39:09')

                }
            }
            if (!empty($batchData)) {
                $this->isiKeteranganModel->insertBatch($batchData);
---
INSERT INTO `db_pju`.`isi_keterangan` (`id_jdlketerangan`, `id_koordinat`, `isi_keterangan`)
VALUES (1,15778,'10523')

    public function delete($id)
    {
        // Pastikan data keterangan ikut terhapus
        $this->isiKeteranganModel->where('id_koordinat', $id)->delete();
---
DELETE FROM `koordinat`
WHERE `id_koordinat` IN ('15777')
DELETE FROM `db_pju`.`isi_keterangan`
WHERE `id_koordinat` = '15777'

    public function getJudulKeteranganBySumberData($id_sumberdata)
    {
        $judulKeterangan = $this->judulKeteranganModel->where('id_sumberdata', $id_sumberdata)->findAll();
---
SELECT *
FROM `judul_keterangan`
WHERE `id_sumberdata` = '3'