app/Controllers/sumberDataController.php

    public function index()
    {
        $data = [
            'title'         => 'Master Sumber Data',
            // findAll() secara otomatis hanya mengambil data yang BELUM di soft delete
            'sumber_data'   => $this->sumberDataModel->findAll()
        ];
---
SELECT *
FROM `sumber_data`