app/Models/M_judulKeterangan.php

SELECT `judul_keterangan`.*, `sumber_data`.`nama_sumber`
FROM `judul_keterangan`
JOIN `sumber_data` ON `sumber_data`.`id_sumberdata` = `judul_keterangan`.`id_sumberdata`
---
    public function getJudulKeterangan()
    {
        // Karena useSoftDeletes = true, findAll() secara otomatis
        // hanya akan mengambil data yang deleted_at-nya NULL (data aktif).
        return $this->select('judul_keterangan.*, sumber_data.nama_sumber')
                    ->join('sumber_data', 'sumber_data.id_sumberdata = judul_keterangan.id_sumberdata')
                    ->findAll();