app/Models/M_koordinat.php

    public function getDataKoordinat()
    {
        return $this->select('koordinat.*, kecamatan.nama_kec, kelurahan.nama_kel, sumber_data.nama_sumber, sumber_data.warna, kota_kab.nama_kotakab')
            ->join('kecamatan', 'kecamatan.id_kec = koordinat.id_kec', 'left')
            ->join('kelurahan', 'kelurahan.id_kel = koordinat.id_kel', 'left')
            ->join('sumber_data', 'sumber_data.id_sumberdata = koordinat.id_sumberdata', 'left')
            ->join('kota_kab', 'kota_kab.id_kotakab = koordinat.id_kotakab', 'left')
            ->findAll();
---
SELECT `koordinat`.*, `kecamatan`.`nama_kec`, `kelurahan`.`nama_kel`, `sumber_data`.`nama_sumber`, `sumber_data`.`warna`, `kota_kab`.`nama_kotakab`
FROM `koordinat`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kec` = `koordinat`.`id_kec`
LEFT JOIN `kelurahan` ON `kelurahan`.`id_kel` = `koordinat`.`id_kel`
LEFT JOIN `sumber_data` ON `sumber_data`.`id_sumberdata` = `koordinat`.`id_sumberdata`
LEFT JOIN `kota_kab` ON `kota_kab`.`id_kotakab` = `koordinat`.`id_kotakab`