app/Models/M_Wilayah.php

SELECT *
FROM `kota_kab`
---
    public function getKotaKab($where = false)
    {
        $builder = $this->db->table('kota_kab');
        if ($where) {
            $builder->where($where);
        }
        return $builder->get()->getResultArray();